code_sweepdelay/stress-output_50ms_at20.log
******************** Stress Settings ********************
Command:
  Type: write
  Count: -1
  Duration: 90 SECONDS
  No Warmup: false
  Consistency Level: ONE
  Target Uncertainty: not applicable
  Key Size (bytes): 10
  Counter Increment Distibution: add=fixed(1)
Rate:
  Auto: false
  Thread Count: 50
  OpsPer Sec: 0
Population:
  Sequence: 1..1000000
  Order: ARBITRARY
  Wrap: true
Insert:
  Revisits: Uniform:  min=1,max=1000000
  Visits: Fixed:  key=1
  Row Population Ratio: Ratio: divisor=1.000000;delegate=Fixed:  key=1
  Batch Type: not batching
Columns:
  Max Columns Per Key: 1
  Column Names: [C0]
  Comparator: AsciiType
  Timestamp: null
  Variable Column Count: false
  Slice: false
  Size Distribution: Fixed:  key=34
  Count Distribution: Fixed:  key=1
Errors:
  Ignore: false
  Tries: 10
Log:
  No Summary: false
  No Settings: false
  File: null
  Interval Millis: 1000
  Level: NORMAL
Mode:
  API: JAVA_DRIVER_NATIVE
  Connection Style: CQL_PREPARED
  CQL Version: CQL3
  Protocol Version: V4
  Username: null
  Password: null
  Auth Provide Class: null
  Max Pending Per Connection: 128
  Connections Per Host: 8
  Compression: NONE
Node:
  Nodes: [cassandra_a, cassandra_b, cassandra_c]
  Is White List: false
  Datacenter: null
Schema:
  Keyspace: keyspace1
  Replication Strategy: org.apache.cassandra.locator.SimpleStrategy
  Replication Strategy Pptions: {replication_factor=3}
  Table Compression: null
  Table Compaction Strategy: null
  Table Compaction Strategy Options: {}
Transport:
  factory=org.apache.cassandra.thrift.TFramedTransportFactory; truststore=null; truststore-password=null; keystore=null; keystore-password=null; ssl-protocol=TLS; ssl-alg=SunX509; store-type=JKS; ssl-ciphers=TLS_RSA_WITH_AES_128_CBC_SHA,TLS_RSA_WITH_AES_256_CBC_SHA; 
Port:
  Native Port: 9042
  Thrift Port: 9160
  JMX Port: 7199
Send To Daemon:
  *not set*
Graph:
  File: null
  Revision: unknown
  Title: null
  Operation: WRITE
TokenRange:
  Wrap: false
  Split Factor: 1

Connected to cluster: TestCluster, max pending requests per connection 128, max connections per host 8
Datatacenter: datacenter1; Host: cassandra_a/172.28.0.2; Rack: rack1
Datatacenter: datacenter1; Host: cassandra_b/172.28.0.3; Rack: rack1
Datatacenter: datacenter1; Host: cassandra_c/172.28.0.4; Rack: rack1
Created keyspaces. Sleeping 3s for propagation.
Sleeping 2s...
Warming up WRITE with 150000 iterations...
Failed to connect over JMX; not collecting these stats
Running WRITE with 50 threads 90 seconds
Failed to connect over JMX; not collecting these stats
type       total ops,    op/s,    pk/s,   row/s,    mean,     med,     .95,     .99,    .999,     max,   time,   stderr, errors,  gc: #,  max ms,  sum ms,  sdv ms,      mb
total,         72212,   72212,   72212,   72212,     0.7,     0.4,     1.1,     1.8,    62.0,   138.9,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
total,        170385,   98173,   98173,   98173,     0.5,     0.4,     1.0,     1.6,     4.1,    18.3,    2.0,  0.06206,      0,      0,       0,       0,       0,       0
total,        257971,   87586,   87586,   87586,     0.6,     0.4,     1.1,     1.7,    34.0,    39.1,    3.0,  0.04155,      0,      0,       0,       0,       0,       0
total,        346742,   88771,   88771,   88771,     0.6,     0.4,     1.1,     1.7,     4.6,    72.2,    4.0,  0.03222,      0,      0,       0,       0,       0,       0
total,        433447,   86705,   86705,   86705,     0.6,     0.4,     1.2,     2.2,     8.8,    67.5,    5.0,  0.02577,      0,      0,       0,       0,       0,       0
total,        518926,   85479,   85479,   85479,     0.6,     0.4,     1.0,     1.8,    60.0,    66.0,    6.0,  0.02161,      0,      0,       0,       0,       0,       0
total,        616498,   97572,   97572,   97572,     0.5,     0.4,     1.1,     1.9,     4.0,    17.3,    7.0,  0.02068,      0,      0,       0,       0,       0,       0
total,        702040,   85542,   85542,   85542,     0.5,     0.4,     1.1,     1.8,    15.3,    61.7,    8.0,  0.01838,      0,      0,       0,       0,       0,       0
total,        792813,   90773,   90773,   90773,     0.6,     0.4,     1.1,     1.8,    62.4,    76.4,    9.0,  0.01720,      0,      0,       0,       0,       0,       0
total,        886218,   93405,   93405,   93405,     0.5,     0.4,     1.0,     1.7,    13.7,    61.5,   10.0,  0.01644,      0,      0,       0,       0,       0,       0
total,        971445,   85227,   85227,   85227,     0.6,     0.4,     1.0,     1.7,    58.4,    72.7,   11.0,  0.01515,      0,      0,       0,       0,       0,       0
total,       1029010,   57565,   57565,   57565,     0.8,     0.4,     1.0,     2.0,    50.6,   101.5,   12.0,  0.02981,      0,      0,       0,       0,       0,       0
total,       1030482,    1472,    1472,    1472,    34.2,    50.3,    50.4,    50.4,    50.6,    50.6,   13.0,  0.08405,      0,      0,       0,       0,       0,       0
total,       1031981,    1499,    1499,    1499,    33.6,    50.3,    50.3,    50.4,    50.5,    50.6,   14.0,  0.11100,      0,      0,       0,       0,       0,       0
total,       1033486,    1505,    1505,    1505,    33.5,    50.3,    50.4,    50.4,    50.5,    50.6,   15.0,  0.12978,      0,      0,       0,       0,       0,       0
total,       1034910,    1424,    1424,    1424,    33.7,    50.3,    50.4,    50.4,    50.5,    50.6,   16.0,  0.14417,      0,      0,       0,       0,       0,       0
total,       1036417,    1507,    1507,    1507,    33.4,    50.3,    50.3,    50.4,    50.5,    50.5,   17.0,  0.15565,      0,      0,       0,       0,       0,       0
total,       1037953,    1536,    1536,    1536,    32.8,    50.3,    50.4,    50.4,    50.5,    50.5,   18.0,  0.16509,      0,      0,       0,       0,       0,       0
total,       1039456,    1503,    1503,    1503,    33.5,    50.3,    50.4,    50.4,    50.5,    50.7,   19.0,  0.17304,      0,      0,       0,       0,       0,       0
total,       1040942,    1486,    1486,    1486,    33.9,    50.3,    50.3,    50.4,    50.4,    50.5,   20.0,  0.17985,      0,      0,       0,       0,       0,       0
total,       1042395,    1453,    1453,    1453,    34.7,    50.3,    50.4,    50.4,    50.5,    50.5,   21.0,  0.18575,      0,      0,       0,       0,       0,       0
total,       1043831,    1436,    1436,    1436,    34.0,    50.2,    50.3,    50.4,    50.4,    50.6,   22.0,  0.19091,      0,      0,       0,       0,       0,       0
total,       1045288,    1457,    1457,    1457,    33.9,    50.3,    50.3,    50.4,    50.7,    51.3,   23.0,  0.19544,      0,      0,       0,       0,       0,       0
total,       1046789,    1501,    1501,    1501,    33.6,    50.3,    50.4,    50.4,    50.6,    50.6,   24.0,  0.19945,      0,      0,       0,       0,       0,       0
total,       1048312,    1523,    1523,    1523,    33.1,    50.3,    50.3,    50.4,    50.4,    50.5,   25.0,  0.20302,      0,      0,       0,       0,       0,       0
total,       1049786,    1474,    1474,    1474,    34.3,    50.3,    50.4,    56.5,   101.7,   102.0,   26.0,  0.20620,      0,      0,       0,       0,       0,       0
total,       1051272,    1486,    1486,    1486,    33.9,    50.3,    50.4,    50.5,    50.6,    50.6,   27.0,  0.20909,      0,      0,       0,       0,       0,       0
total,       1052781,    1509,    1509,    1509,    32.4,    50.2,    50.3,    50.4,    50.5,    50.5,   28.0,  0.21170,      0,      0,       0,       0,       0,       0
total,       1054293,    1512,    1512,    1512,    32.7,    50.2,    50.3,    50.4,    50.4,    50.7,   29.0,  0.21406,      0,      0,       0,       0,       0,       0
total,       1055825,    1532,    1532,    1532,    32.9,    50.2,    50.3,    50.4,    50.5,    50.5,   30.0,  0.21621,      0,      0,       0,       0,       0,       0
total,       1057313,    1488,    1488,    1488,    33.8,    50.2,    50.3,    50.4,    50.4,    50.4,   31.0,  0.21817,      0,      0,       0,       0,       0,       0
total,       1058845,    1532,    1532,    1532,    32.9,    50.2,    50.3,    50.4,    50.4,    50.5,   32.0,  0.21996,      0,      0,       0,       0,       0,       0
total,       1060360,    1515,    1515,    1515,    33.3,    50.2,    50.3,    50.4,    51.4,    51.7,   33.0,  0.22160,      0,      0,       0,       0,       0,       0
total,       1061854,    1494,    1494,    1494,    33.3,    50.2,    50.3,    50.4,    50.4,    50.4,   34.0,  0.22311,      0,      0,       0,       0,       0,       0
total,       1063329,    1475,    1475,    1475,    33.2,    50.2,    50.3,    50.4,    50.4,    50.4,   35.0,  0.22451,      0,      0,       0,       0,       0,       0
total,       1064846,    1517,    1517,    1517,    32.9,    50.2,    50.3,    50.4,    50.4,    50.5,   36.0,  0.22579,      0,      0,       0,       0,       0,       0
total,       1066330,    1484,    1484,    1484,    33.9,    50.2,    50.3,    50.4,    50.4,    50.4,   37.0,  0.22697,      0,      0,       0,       0,       0,       0
total,       1067812,    1482,    1482,    1482,    34.0,    50.2,    50.3,    50.4,    50.5,    50.5,   38.0,  0.22807,      0,      0,       0,       0,       0,       0
total,       1069319,    1507,    1507,    1507,    33.4,    50.2,    50.3,    50.4,    50.4,    50.5,   39.0,  0.22907,      0,      0,       0,       0,       0,       0
total,       1070755,    1436,    1436,    1436,    34.9,    50.2,    50.3,    50.4,    50.4,    50.5,   40.0,  0.23002,      0,      0,       0,       0,       0,       0
total,       1072248,    1493,    1493,    1493,    33.4,    50.2,    50.3,    50.4,    50.5,    50.5,   41.0,  0.23088,      0,      0,       0,       0,       0,       0
total,       1073727,    1479,    1479,    1479,    32.9,    50.2,    50.3,    50.4,    50.5,    51.1,   42.0,  0.23169,      0,      0,       0,       0,       0,       0
total,       1075184,    1457,    1457,    1457,    34.5,    50.2,    50.3,    50.4,    50.5,    50.5,   43.0,  0.23244,      0,      0,       0,       0,       0,       0
total,       1076618,    1434,    1434,    1434,    35.1,    50.2,    50.3,    50.4,    50.5,    50.5,   44.0,  0.23314,      0,      0,       0,       0,       0,       0
total,       1078097,    1479,    1479,    1479,    34.1,    50.2,    50.3,    50.4,    50.4,    50.4,   45.0,  0.23378,      0,      0,       0,       0,       0,       0
total,       1079552,    1455,    1455,    1455,    34.5,    50.3,    50.3,    50.4,    50.4,    50.4,   46.0,  0.23438,      0,      0,       0,       0,       0,       0
total,       1081028,    1476,    1476,    1476,    34.1,    50.2,    50.3,    50.4,    50.4,    50.5,   47.0,  0.23493,      0,      0,       0,       0,       0,       0
total,       1082546,    1518,    1518,    1518,    32.4,    50.2,    50.3,    50.4,    50.4,    50.6,   48.0,  0.23543,      0,      0,       0,       0,       0,       0
total,       1083994,    1448,    1448,    1448,    34.0,    50.2,    50.3,    50.4,    50.4,    50.4,   49.0,  0.23591,      0,      0,       0,       0,       0,       0
total,       1085535,    1541,    1541,    1541,    32.7,    50.3,    50.3,    50.4,    50.5,    50.5,   50.0,  0.23632,      0,      0,       0,       0,       0,       0
total,       1086986,    1451,    1451,    1451,    34.7,    50.2,    50.3,    50.4,    50.5,    50.6,   51.0,  0.23674,      0,      0,       0,       0,       0,       0
total,       1088494,    1508,    1508,    1508,    33.3,    50.2,    50.3,    50.4,    50.4,    50.5,   52.0,  0.23710,      0,      0,       0,       0,       0,       0
total,       1090007,    1513,    1513,    1513,    33.2,    50.2,    50.3,    50.4,    50.4,    50.4,   53.0,  0.23743,      0,      0,       0,       0,       0,       0
total,       1091514,    1507,    1507,    1507,    33.4,    50.2,    50.3,    50.4,    50.4,    50.5,   54.0,  0.23774,      0,      0,       0,       0,       0,       0
total,       1092919,    1405,    1405,    1405,    34.8,    50.3,    50.3,    50.4,    50.4,    50.5,   55.0,  0.23805,      0,      0,       0,       0,       0,       0
total,       1094398,    1479,    1479,    1479,    33.5,    50.3,    50.3,    50.4,    50.4,    50.5,   56.0,  0.23832,      0,      0,       0,       0,       0,       0
total,       1095920,    1522,    1522,    1522,    33.1,    50.2,    50.3,    50.4,    50.6,    50.7,   57.0,  0.23855,      0,      0,       0,       0,       0,       0
total,       1097416,    1496,    1496,    1496,    33.7,    50.2,    50.3,    50.4,    50.5,    50.7,   58.0,  0.23877,      0,      0,       0,       0,       0,       0
total,       1098917,    1501,    1501,    1501,    33.5,    50.2,    50.3,    50.4,    50.4,    50.5,   59.0,  0.23897,      0,      0,       0,       0,       0,       0
total,       1100427,    1510,    1510,    1510,    33.3,    50.3,    50.3,    50.4,    50.5,    50.5,   60.0,  0.23914,      0,      0,       0,       0,       0,       0
total,       1101910,    1483,    1483,    1483,    33.7,    50.3,    50.3,    50.4,    50.4,    50.5,   61.0,  0.23931,      0,      0,       0,       0,       0,       0
total,       1103406,    1496,    1496,    1496,    32.4,    50.3,    50.3,    50.4,    50.4,    50.5,   62.0,  0.23945,      0,      0,       0,       0,       0,       0
total,       1104958,    1552,    1552,    1552,    32.5,    50.3,    50.3,    50.4,    50.4,    50.5,   63.0,  0.23956,      0,      0,       0,       0,       0,       0
total,       1106497,    1539,    1539,    1539,    32.7,    50.3,    50.3,    50.4,    50.5,    50.6,   64.0,  0.23967,      0,      0,       0,       0,       0,       0
total,       1107989,    1492,    1492,    1492,    33.7,    50.2,    50.3,    50.4,    50.4,    50.4,   65.0,  0.23977,      0,      0,       0,       0,       0,       0
total,       1109470,    1481,    1481,    1481,    34.0,    50.3,    50.3,    50.4,    50.4,    50.4,   66.0,  0.23986,      0,      0,       0,       0,       0,       0
total,       1110975,    1505,    1505,    1505,    33.4,    50.3,    50.3,    50.4,    50.5,    50.7,   67.0,  0.23993,      0,      0,       0,       0,       0,       0
total,       1112447,    1472,    1472,    1472,    33.2,    50.3,    50.4,    50.4,    50.5,    50.5,   68.0,  0.23999,      0,      0,       0,       0,       0,       0
total,       1113946,    1499,    1499,    1499,    33.1,    50.3,    50.3,    50.4,    50.5,    50.5,   69.0,  0.24004,      0,      0,       0,       0,       0,       0
total,       1115477,    1531,    1531,    1531,    32.9,    50.3,    50.3,    50.4,    50.5,    50.5,   70.0,  0.24007,      0,      0,       0,       0,       0,       0
total,       1117021,    1544,    1544,    1544,    32.5,    50.2,    50.3,    50.4,    50.4,    50.5,   71.0,  0.24009,      0,      0,       0,       0,       0,       0
total,       1118544,    1523,    1523,    1523,    33.1,    50.3,    50.4,    50.4,    50.5,    50.5,   72.0,  0.24010,      0,      0,       0,       0,       0,       0
total,       1120024,    1480,    1480,    1480,    34.0,    50.3,    50.4,    50.4,    50.5,    50.5,   73.0,  0.24011,      0,      0,       0,       0,       0,       0
total,       1121502,    1478,    1478,    1478,    33.9,    50.3,    50.3,    50.4,    50.5,    50.5,   74.0,  0.24011,      0,      0,       0,       0,       0,       0
total,       1122993,    1491,    1491,    1491,    32.4,    50.3,    50.3,    50.4,    50.5,    50.5,   75.0,  0.24010,      0,      0,       0,       0,       0,       0
total,       1124492,    1499,    1499,    1499,    33.6,    50.3,    50.3,    50.4,    50.5,    50.5,   76.0,  0.24008,      0,      0,       0,       0,       0,       0
total,       1125947,    1455,    1455,    1455,    34.6,    50.3,    50.4,    96.5,   101.4,   101.6,   77.0,  0.24004,      0,      0,       0,       0,       0,       0
total,       1127440,    1493,    1493,    1493,    33.7,    50.3,    50.4,    50.4,    50.6,    50.7,   78.0,  0.24001,      0,      0,       0,       0,       0,       0
total,       1128904,    1464,    1464,    1464,    34.4,    50.3,    50.3,    50.4,    50.5,    50.5,   79.0,  0.23998,      0,      0,       0,       0,       0,       0
total,       1130352,    1448,    1448,    1448,    34.6,    50.3,    50.3,    50.4,    50.4,    50.5,   80.0,  0.23994,      0,      0,       0,       0,       0,       0
total,       1131844,    1492,    1492,    1492,    32.9,    50.3,    50.3,    50.4,    50.5,    50.5,   81.0,  0.23988,      0,      0,       0,       0,       0,       0
total,       1133343,    1499,    1499,    1499,    33.1,    50.3,    50.3,    50.4,    50.5,    50.5,   82.0,  0.23982,      0,      0,       0,       0,       0,       0
total,       1134813,    1470,    1470,    1470,    34.2,    50.3,    50.3,    50.4,    50.4,    50.5,   83.0,  0.23976,      0,      0,       0,       0,       0,       0
total,       1136319,    1506,    1506,    1506,    33.4,    50.3,    50.4,    50.4,    50.5,    50.5,   84.0,  0.23968,      0,      0,       0,       0,       0,       0
total,       1137769,    1450,    1450,    1450,    34.7,    50.3,    50.4,    50.4,    50.5,    50.5,   85.0,  0.23962,      0,      0,       0,       0,       0,       0
total,       1139302,    1533,    1533,    1533,    32.9,    50.3,    50.4,    50.5,    50.6,    50.6,   86.0,  0.23952,      0,      0,       0,       0,       0,       0
total,       1140775,    1473,    1473,    1473,    33.5,    50.3,    50.4,    50.5,    50.7,    50.9,   87.0,  0.23944,      0,      0,       0,       0,       0,       0
total,       1142215,    1440,    1440,    1440,    34.2,    50.3,    50.3,    50.4,    50.4,    50.5,   88.0,  0.23935,      0,      0,       0,       0,       0,       0
total,       1143741,    1526,    1526,    1526,    32.9,    50.3,    50.3,    50.4,    50.4,    50.5,   89.0,  0.23925,      0,      0,       0,       0,       0,       0
total,       1145252,    1511,    1511,    1511,    33.3,    50.3,    50.3,    50.4,    50.4,    50.5,   90.0,  0.23914,      0,      0,       0,       0,       0,       0
total,       1145370,    1472,    1472,    1472,    39.3,    50.3,    51.0,    51.2,    51.4,    51.4,   90.1,  0.23846,      0,      0,       0,       0,       0,       0


Results:
Op rate                   :   12,715 op/s  [WRITE: 12,715 op/s]
Partition rate            :   12,715 pk/s  [WRITE: 12,715 pk/s]
Row rate                  :   12,715 row/s [WRITE: 12,715 row/s]
Latency mean              :    3.9 ms [WRITE: 3.9 ms]
Latency median            :    0.4 ms [WRITE: 0.4 ms]
Latency 95th percentile   :   50.3 ms [WRITE: 50.3 ms]
Latency 99th percentile   :   50.3 ms [WRITE: 50.3 ms]
Latency 99.9th percentile :   50.4 ms [WRITE: 50.4 ms]
Latency max               :  138.9 ms [WRITE: 138.9 ms]
Total partitions          :  1,145,370 [WRITE: 1,145,370]
Total errors              :          0 [WRITE: 0]
Total GC count            : 0
Total GC memory           : 0.000 KiB
Total GC time             :    0.0 seconds
Avg GC time               :    NaN ms
StdDev GC time            :    0.0 ms
Total operation time      : 00:01:30

END